# Hierarchical Indexing
Hierarchical indexing is an important feature of pandas enabling you to have multiple (two or more) index levels on an axis.

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [5]:
# nested/multi indexing
data = Series(np.random.randn(10), index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                                         [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [3]:
data

a  1    0.196135
   2   -0.384016
   3   -0.712696
b  1   -0.989246
   2    1.426051
   3    0.098575
c  1   -0.857614
   2   -0.451035
d  2    0.687531
   3   -0.169590
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [9]:
data['b']

1   -1.508966
2   -2.338267
3   -0.318746
dtype: float64

In [10]:
data[['a', 'b']]

a  1   -0.537857
   2    0.522074
   3    1.316762
b  1   -1.508966
   2   -2.338267
   3   -0.318746
dtype: float64

Re-indexing this multi-indexed data with `unstack()` method

In [11]:
data.unstack()

          1         2         3
a -0.537857  0.522074  1.316762
b -1.508966 -2.338267 -0.318746
c -0.528941 -1.822050       NaN
d       NaN -0.943261  1.177291

In [14]:
data.unstack().stack() # use stack() to reverse

a  1   -0.537857
   2    0.522074
   3    1.316762
b  1   -1.508966
   2   -2.338267
   3   -0.318746
c  1   -0.528941
   2   -1.822050
d  2   -0.943261
   3    1.177291
dtype: float64

In [15]:
frame = DataFrame(np.arange(12).reshape(4, 3),
                 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns=[['ohio', 'ohio', 'colorado'],
                         ['green', 'red', 'green']])

In [16]:
frame

     ohio     colorado
    green red    green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [17]:
frame.columns

MultiIndex([(    'ohio', 'green'),
            (    'ohio',   'red'),
            ('colorado', 'green')],
           )

In [18]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [19]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [20]:
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [24]:
frame['ohio']

color      green  red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10